[
    "The frame shows a desk against a light blue wall. On the desk, there is a computer monitor displaying code, a keyboard, and a mouse. To the right of the monitor, there's a power strip with several plugs and an internet router. Above the desk on the wall, there's a calendar for 2026 and some notes pinned. A red plastic chair is positioned in front of the desk, facing the monitor. A yellow garment is visible on the floor to the left of the chair. A black cable runs from the top of the wall towards the power strip.",
    "The frame maintains the initial setup of the desk against the light blue wall, with the computer monitor displaying code, keyboard, mouse, power strip, and internet router all in their previous positions. The 2026 calendar and notes are still pinned above the desk. The red plastic chair remains in front of the desk, but a significant portion of its left side and the desk are now obscured by a person's arm and shoulder, which are in the foreground on the left. The person appears to be wearing a dark grey, possibly hooded, garment, and their hand is partially visible at the bottom of the frame. The yellow garment on the floor from the previous frame is still present, visible below the person's arm. The black cable running from the top of the wall towards the power strip is also still present.",
    "The frame shows a young person now standing in front of the desk, facing the camera. They are clearly visible, wearing a dark grey, striped long-sleeved shirt with a darker collar and cuffs, and dark pants. A pair of glasses rests on their nose, and a thin, dark wire or cord hangs around their neck and down the front of their shirt. A circular badge or emblem is visible on the upper left side of their shirt. The desk and chair are still present but largely obscured by the person's body. The computer monitor, power strip, and internet router are still faintly visible behind the person on the right side of the frame. The light blue wall and the black cable running down it are also visible behind the person. The yellow garment previously on the floor is no longer visible.",
    "The current frame maintains the presence of the young person, now seen from the chest up, occupying the central focus. They are still wearing the dark grey, striped long-sleeved shirt, dark pants, and glasses. However, a significant change is observed in their posture: their arms are raised with hands near their head, each forming a 'V' sign with their fingers. The thin, dark wire or cord is still visible around their neck, with earbuds now hanging down more prominently. The circular badge on the upper left side of their shirt is also clearly visible. The light blue wall remains in the background, and the black cable is still running down it. On the right side of the frame, behind the person, the desk, a red chair, and the computer monitor are visible, along with the power strip and internet router mounted on the wall. A small portion of the yellow garment is now faintly visible again on the floor on the far left.",
    "The current frame, at second 4, presents a slightly different angle and cropping of the young person. They are now seen from approximately the mid-thigh up, maintaining their central position in the frame. They are still wearing the dark grey, striped long-sleeved shirt, dark pants, and glasses. Their posture has changed significantly; their arms are now down by their sides, and their head is turned to the right side of the frame, looking off into the distance. The thin, dark wire or cord is still visible around their neck, with earbuds hanging down. The circular badge on the upper left side of their shirt is less prominent due to the change in angle. The light blue wall remains in the background, and the black cable is still running down it. On the right side of the frame, behind the person, the desk, a red chair, and the computer monitor are still visible, along with the power strip and internet router mounted on the wall. The small portion of the yellow garment on the floor on the far left is no longer visible due to the closer crop of the subject.",
    "The current frame, at second 5, shows the young person from approximately the mid-thigh up, still positioned centrally. They are wearing the same dark grey, striped long-sleeved shirt, dark pants, and glasses. Their head is now facing forward, towards the camera. Both of their hands are raised to chest height, with their fingers lightly touching their abdomen, suggesting a movement or adjustment of their clothing. The thin, dark wire or cord is still around their neck with earbuds hanging down, and the circular badge with '11' is visible on their upper left shirt. The light blue wall remains in the background, with the black cable stretching down it. A white calendar for the year '2026' is now visible hanging on the light blue wall to the left of the person. On the right side of the frame, behind the person, the top portion of a red chair is visible, along with parts of the desk.",
    "The current frame, at second 6, shows the young person from approximately the mid-thigh up, still positioned centrally. They are wearing the same dark grey, striped long-sleeved shirt, dark pants with the 'JOHARI GOLD' logo, and glasses. Their head is now facing slightly more to the right, looking away from the camera's direct gaze, and their facial expression appears neutral. Both of their hands are lowered, with their fingers now touching the front waistline of their pants, suggesting they are adjusting their clothing. The thin, dark wire or cord is still around their neck with earbuds hanging down, and the circular badge with '11' is visible on their upper left shirt. The light blue wall remains in the background, with the black cable stretching down it in the lower left background. The white '2026' calendar is still visible hanging on the light blue wall to the left of the person. On the right side of the frame, behind the person, the top portion of a red chair is still visible, along with parts of the desk, and a glimpse of a yellow item at the bottom left foreground suggests a continuation of the previously visible background elements.",
    "The current frame, at second 7, shows the young person from approximately the mid-thigh up, still positioned centrally, but they have shifted their weight, now leaning slightly to their left with their left shoulder elevated. Their head is now turned further to the right, with their gaze directed upwards and away from the camera, and their expression has changed to a slight, subtle smirk. They are still wearing the same dark grey, striped long-sleeved shirt with the circular '11' badge visible on their upper left shirt, dark pants with the 'JOHARI GOLD' logo on the right thigh, and glasses. The thin, dark wire or cord is still around their neck with earbuds hanging down. Their right hand is now raised and placed behind their head, with fingers lightly touching their hair, while their left hand remains lowered, with fingers still touching the front waistline of their pants. The light blue wall remains in the background, with the black cable stretching down it in the lower left background, and the white '2026' calendar is still visible hanging on the light blue wall to the left of the person. On the right side of the frame, behind the person, a portion of the red chair's backrest is visible, along with parts of the desk, and a glimpse of a yellow item at the bottom left foreground.",
    "The current frame, at second 8, shows the young person from approximately the mid-thigh up, still positioned centrally. Their weight has shifted further to their right, and their left shoulder has lowered, while their right shoulder is now slightly elevated. Their head is now turned slightly to the left, looking generally in the direction of the camera. The subtle smirk from the previous frame is no longer discernible. They are still wearing the same dark grey, striped long-sleeved shirt, although the '11' badge is no longer visible due to the change in posture, dark pants with the 'JOHARI GOLD' logo no longer visible on the right thigh, and glasses. The thin, dark wire or cord is still around their neck with earbuds hanging down. Their right hand is now raised towards their right ear, seemingly adjusting or touching an earbud, while their left hand is still lowered, with fingers touching the front waistline of their pants. The light blue wall remains in the background, with the black cable stretching down it in the lower left background, and the white '2026' calendar is still visible hanging on the light blue wall to the left of the person. On the right side of the frame, behind the person, a portion of the red chair's backrest is visible, along with parts of the desk, and a glimpse of a yellow item at the bottom left foreground. A computer monitor showing code is now clearly visible on the desk to the person's right.",
    "The current frame, at second 9, shows the young person from approximately the lower-chest up, slightly blurred, indicating movement, and positioned more towards the left side of the frame, having shifted significantly from the central position in the previous frame. Their body is now angled more towards their right, with their left shoulder appearing higher and their right shoulder lower than in the previous frame. Their head is still turned towards the left, looking generally in the direction of the camera, but with a more pronounced downward tilt. The glasses are still visible on their face. They are wearing the same dark grey, striped long-sleeved shirt and dark pants. The thin, dark wire or cord is still around their neck. Both hands are now lowered out of view. The light blue wall remains in the background, with the white '2026' calendar still visible hanging on the light blue wall to the left of the person. On the right side of the frame, behind the person, the red chair's backrest is still visible, along with parts of the desk, and the computer monitor showing code.",
    "'The current frame, at second 10, shows the young person from approximately the waist up, now significantly further to the right side of the frame compared to the previous frame, and blurred, indicating rapid movement. Their body is more upright and twisted towards their right, with their left shoulder still appearing higher than their right. Their head is turned more sharply to the left and slightly tilted downwards, looking generally towards the camera. They are still wearing glasses and the same dark grey, striped long-sleeved shirt and dark pants, with the thin, dark wire or cord still visible around their neck. Both hands are now actively engaged in holding a red chair, which is partially visible on the right side of the frame, appearing to be in motion as if being lifted or swung. The chair has a similar design to the one seen in previous frames, with a dark red or maroon color and a patterned backrest. The light blue wall remains in the background, with the white '2026' calendar still visible hanging on the light blue wall to the far left of the person. On the right side of the frame, behind the person and the moving chair, the desk and the computer monitor showing code are still visible, though more obscured by the person and chair's movement.'",
    "'The current frame, at second 11, shows the young person from approximately the waist up, now standing further to the right side of the frame and in sharp focus, unlike the blurring observed in the previous frame, suggesting a pause in their rapid movement. Their body is more upright and twisted towards their right, with their left shoulder still appearing slightly higher than their right. Their head is turned more sharply to the left and slightly tilted downwards, looking directly towards the camera with a neutral expression. They are still wearing glasses and the same dark grey, striped long-sleeved shirt and dark pants, with the thin, dark wire or cord still visible around their neck. Both hands are now actively engaged in holding the red chair above their head, as if in the process of putting it back down or having just completed a lift. The red chair is clearly visible, with its patterned backrest and dark red or maroon color. The light blue wall remains in the background. The white '2026' calendar is no longer visible on the far left. On the right side of the frame, behind the person and the chair, the desk and the computer monitor showing code are still visible, though more obscured by the person and the chair's position.'",
    "'The current frame, at second 12, continues to show the young person from approximately the waist up, but they have now lowered the red chair significantly. The chair is positioned in front of them, with their hands resting on the top edge of the chair's backrest. The red chair, with its patterned back, is now clearly visible in the lower center of the frame, no longer held above their head. The person's body is more upright and centered, facing more directly towards the camera than in the previous frame. Their head is also more upright, and they are looking straight ahead with a neutral expression, still wearing glasses and the dark grey, striped long-sleeved shirt and dark pants. The thin, dark wire or cord is still visible around their neck. The light blue wall remains in the background, with the white power outlet and black device on the right side of the frame still visible, though the area where the desk and computer monitor were is now largely obscured by the person and the chair, making it less distinguishable.'",
    "The current frame, at second 13, shows a significant and abrupt change in the scene. The young person and the red chair, which were central in the previous frame, are now entirely out of view. The frame is dominated by a close-up, blurry view of what appears to be a wooden table or desk surface in the lower half of the frame. Above the table, the light blue wall is visible, along with parts of the white power outlet and black device on the right side. A thin, dark cable or wire is still present across the wall. In the upper left quadrant of the frame, a dark, blurry shape, likely belonging to the person or part of their clothing, can be seen quickly moving out of frame. The overall impression is one of rapid movement, suggesting the person has quickly moved away from their previous position."
]